TXmlNfe/downfe-env.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeDownloadNF"><versaoDados>1.00</versaoDados><cUF>33</cUF></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeDownloadNF"><downloadNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="1.00"><tpAmb>1</tpAmb><xServ>DOWNLOAD NFE</xServ><CNPJ>02370420000195</CNPJ><chNFe>33150300070112000542550090003047941807395512</chNFe></downloadNFe></nfeDadosMsg></soap:Body></soap:Envelope>